app/controllers/posts_controller.rb

  def index
    @posts = Post.order("name").page(params[:page]).per(2)
---
SELECT "posts".* FROM "posts" ORDER BY name LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "published", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "posts" SET "content" = '<p style="padding-left: 30px;"><strong>Prueba Contenido WYSIWYG</strong>..... <span style="text-decoration: underline;">Mas facil que Django</span></p>', "updated_at" = '2013-05-30 16:45:16.797123' WHERE "posts"."id" = 4